Terraform plan in __terraform__
<details>
  <summary>Plan: 2 to add, 3 to change, 0 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloudfunctions_function.gmail_notifier_initWatch_function will be created
  + resource "google_cloudfunctions_function" "gmail_notifier_initWatch_function" {
      + available_memory_mb   = 256
      + description           = "init watch on given gmail inbox"
      + entry_point           = "initWatch"
      + https_trigger_url     = (known after apply)
      + id                    = (known after apply)
      + max_instances         = 0
      + name                  = "initWatch"
      + project               = (known after apply)
      + region                = (known after apply)
      + runtime               = "nodejs14"
      + service_account_email = (known after apply)
      + source_archive_bucket = "lilaobot-functions-storage"
      + source_archive_object = "gmail_notifier.zip#b2305691a8116e9e3401f86e3c0a8b6b"
      + timeout               = 60
      + trigger_http          = true

      + event_trigger {
          + event_type = (known after apply)
          + resource   = (known after apply)

          + failure_policy {
              + retry = (known after apply)
            }
        }
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2callback_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2callback_function" {
      ~ available_memory_mb   = 128 -> 256
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2callback"
        name                  = "oauth2callback"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#b2305691a8116e9e3401f86e3c0a8b6b"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.gmail_notifier_oauth2init_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "gmail_notifier_oauth2init_function" {
      ~ available_memory_mb   = 128 -> 256
        id                    = "projects/lilaobot/locations/europe-west1/functions/oauth2init"
        name                  = "oauth2init"
      ~ source_archive_object = "gmail_notifier.zip" -> "gmail_notifier.zip#b2305691a8116e9e3401f86e3c0a8b6b"
        # (13 unchanged attributes hidden)
    }

  # google_cloudfunctions_function.slack_publisher_function will be updated in-place
  ~ resource "google_cloudfunctions_function" "slack_publisher_function" {
        id                    = "projects/lilaobot/locations/europe-west1/functions/slack-publisher"
        name                  = "slack-publisher"
      ~ source_archive_object = "slack_publisher.zip" -> "slack_publisher.zip#4fbd529289d366c584be6729c6d80e09"
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_cloudfunctions_function_iam_member.initWatch_allusers_permission will be created
  + resource "google_cloudfunctions_function_iam_member" "initWatch_allusers_permission" {
      + cloud_function = "initWatch"
      + etag           = (known after apply)
      + id             = (known after apply)
      + member         = "allUsers"
      + project        = (known after apply)
      + region         = (known after apply)
      + role           = "roles/cloudfunctions.invoker"
    }

Plan: 2 to add, 3 to change, 0 to destroy.
```
</details>

Plan generated in [Create terraform plan #37](https://github.com/Zenika/lilaobot/actions/runs/1234193969)